# Análise exploratória de dados com Pandas

Autor: Marcos Santana
Curso: Ciência de Dados e I.A.

Objetivo: Explorar um conjunto de dados utilizando pandas para extrair
informações básicas.

In [3]:
# Célula de importação

import pandas as pd

In [4]:
# Célula de dados(nome, idade, nota e faltas de alunos)

dados = {
    "nome": ["Ana", "Bruno", "Carlos", "Diana", "Edu"],
    "idade": [20, 17, 22, 19, 16],
    "nota": [8.5, 5.0, 6.8, 9.2, 4.5],
    "faltas": [2, 5, 1, 0, 6]
}

df = pd.DataFrame(dados)
df

     nome  idade  nota  faltas
0     Ana     20   8.5       2
1   Bruno     17   5.0       5
2  Carlos     22   6.8       1
3   Diana     19   9.2       0
4     Edu     16   4.5       6

In [5]:
# Extração de informações

df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    5 non-null      object
 1   idade   5 non-null      int64
 2   nota    5 non-null      float64
 3   faltas  5 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 292.0+ bytes

           idade      nota    faltas
count   5.000000  5.000000  5.000000
mean   18.800000  6.800000  2.800000
std     2.387467  2.072438  2.588436
min    16.000000  4.500000  0.000000
25%    17.000000  5.000000  1.000000
50%    19.000000  6.800000  2.000000
75%    20.000000  8.500000  5.000000
max    22.000000  9.200000  6.000000

In [36]:
# Quantos alunos são maiores de idade?
maiores = []
for i in df['idade']:
    if i >= 18:
        maiores.append(i)
print(len(maiores))
# ou
# df[df['idade']>=18].shape[0]

3

In [30]:
# Qual a média da nota dos aprovados
aprovados = df[df['nota']>=6]
aprovados['nota'].mean()

8.166666666666666

In [33]:
# Quem tem mais faltas:
df.loc[df['faltas'].idxmax()]["na"]

'Edu'

In [35]:
# Criação de nova coluna
def classificar_aluno(linha):
    if linha['nota']>=6 and linha['faltas']<=3:
        return "Aprovado"
    else:
        return "Reprovado"
df['Status']=df.apply(classificar_aluno, axis=1)
df

     nome  idade  nota  faltas     Status
0     Ana     20   8.5       2   Aprovado
1   Bruno     17   5.0       5  Reprovado
2  Carlos     22   6.8       1   Aprovado
3   Diana     19   9.2       0   Aprovado
4     Edu     16   4.5       6  Reprovado